YuzheJi/ELEC-291-project-2/EFM8_JDY40_test_Slave/main.c
    // Initialize Timer 5 for periodic interrupts
	SFRPAGE=0x10;
	TMR5CN0=0x00;
	TMR5=0xffff;   // Set to reload immediately
	EIE2|=0b_0000_1000; // Enable Timer5 interrupts
	TR5=1;         // Start Timer5 (TMR5CN0 is bit addressable)
	
	EA=1;  // Enable global interrupts
	SFRPAGE=0x00;
	
	return 0;
}

// Uses Timer3 to delay <us> micro-seconds. 
void Timer3us(unsigned char us)
{
	unsigned char i;               // usec counter
	
	// The input for Timer 3 is selected as SYSCLK by setting T3ML (bit 6) of CKCON0:
	CKCON0|=0b_0100_0000;
	
	TMR3RL = (-(SYSCLK)/1000000L); // Set Timer3 to overflow in 1us.
	TMR3 = TMR3RL;                 // Initialize Timer3 for first overflow
	
	TMR3CN0 = 0x04;                 // Sart Timer3 and clear overflow flag
	for (i = 0; i < us; i++)       // Count <us> overflows
	{
		while (!(TMR3CN0 & 0x80));  // Wait for overflow
		TMR3CN0 &= ~(0x80);         // Clear overflow indicator
	}
	TMR3CN0 = 0 ;                   // Stop Timer3 and clear overflow flag
}

void waitms (unsigned int ms)
{
	unsigned int j;
	unsigned char k;
	for(j=0; j<ms; j++)
		for (k=0; k<4; k++) Timer3us(250);
}

unsigned char SPI_transfer(unsigned char tx_data)
{
    SPI0DAT = tx_data;  // Send data
    while (!SPIF);      // Wait for transfer to complete
    SPIF = 0;           // Clear SPI interrupt flag
    return SPI0DAT;     // Return received data
}

unsigned char SPI_read(unsigned char reg_addr)
{
    xdata unsigned char value;
    
    // For SPI read operation, set MSB of address to 1
    reg_addr = reg_addr | 0x80;
    
    CS = 0;                // Select the device
    SPI_transfer(reg_addr);     // Send register address
    value = SPI_transfer(0x00); // Read value (send dummy byte) dummy byte is a placeholder byte sent by the master when it wants to receive data
    CS = 1;                // Deselect the device
    
    return value;
}

void SPI_write(unsigned char reg_addr, unsigned char reg_value)
{
    // For SPI write operation, MSB should be 0
    reg_addr = reg_addr & 0x7F;
    
    CS = 0;                // Select device
    SPI_transfer(reg_addr);     // Send register address
    SPI_transfer(reg_value);    // Send value
    CS = 1;                // Deselect device
}

void BMM150_Read_Trim_Registers(void)
{
	// xdata uint8_t i; 
	xdata uint16_t temp_msb; 
	xdata uint8_t trim_x1y1[2] = {0};
	xdata uint8_t trim_xyz_data[4] = {0};
	xdata uint8_t trim_xy1xy2[10] = {0};
	temp_msb = 0; 
	// Reading trim_x1y1 at 0x5D
	for (i=0;i<2;i++){
		trim_x1y1[i] = SPI_read(BMM150_DIG_X1+i); 
	}
	for (i=0;i<4;i++){
		trim_xyz_data[i] = SPI_read(BMM150_DIG_Z4_LSB+i);
	}
	for (i=0;i<10;i++){
		trim_xy1xy2[i] = SPI_read(BMM150_DIG_Z2_LSB+i);
	}
	// Update trim data 
	dig_x1 = (int8_t) trim_x1y1[0]; 
	dig_y1 = (int8_t) trim_x1y1[1]; 
	dig_x2 = (int8_t) trim_xyz_data[2]; 
	dig_y2 = (int8_t) trim_xyz_data[3]; 

	// temp_msb = ((uint16_t)trim_xy1xy2[3]) << 8;
	// dig_z1 = (uint16_t)(temp_msb | trim_xy1xy2[2]);

	// temp_msb = ((uint16_t)trim_xy1xy2[1]) << 8;
	// dig_z2 = (int16_t)(temp_msb | trim_xy1xy2[0]);

	// temp_msb = ((uint16_t)trim_xy1xy2[7]) << 8;
	// dig_z3 = (int16_t)(temp_msb | trim_xy1xy2[6]);

	// temp_msb = ((uint16_t)trim_xyz_data[1]) << 8;
	// dig_z4 = (int16_t)(temp_msb | trim_xyz_data[0]);

	dig_xy1 = trim_xy1xy2[9];
	dig_xy2 = (int8_t)trim_xy1xy2[8];

	temp_msb = ((uint16_t)(trim_xy1xy2[5] & 0x7F)) << 8;
	dig_xyz1 = (uint16_t)(temp_msb | trim_xy1xy2[4]);

}

void BMM150_Init(void)
{
    xdata unsigned char chip_id;
    
    // Set all required pins
    CS = 1; // Deselect BMM150
    
    // Wait for sensor startup
    waitms(10);
    
    // Software reset by setting bit 7 and bit 1 in register 0x4B
    SPI_write(BMM150_POWER_CONTROL, 0x82);
    waitms(10);  // Wait for reset to complete
    
    // Power on the sensor (set power control bit)
    SPI_write(BMM150_POWER_CONTROL, BMM150_POWER_ON);
    waitms(5);
    
    // Read and verify chip ID
    chip_id = SPI_read(BMM150_CHIP_ID);
    if (chip_id != BMM150_CHIP_ID_VALUE)
    {
        printf("Error: Could not find BMM150 sensor (Chip ID: 0x%02X)\r\n", chip_id);
        // while (1) {
        //     printf("Press restart to check again!\r");
        // }; // Halt if sensor not found
    }
	else {
		// printf("DONE! Chip ID = 0x%02X\r\n", chip_id);
	}
    
    // Set operation mode to normal and data rate to 10Hz
    SPI_write(BMM150_OP_MODE, BMM150_NORMAL_MODE | (BMM150_ODR_10HZ * 8));
    
    // Set repetitions for XY and Z axes for regular preset
    SPI_write(BMM150_REP_XY, 0x7F); // XY-repetitions = 9
    SPI_write(BMM150_REP_Z, 0x0E);  // Z-repetitions = 15

	BMM150_Read_Trim_Registers();
    
    printf("BMM150 initialized successfully! Chip ID: 0x%02X\r\n", chip_id);
	return; 
}

int16_t BMM150_compensate_x(int16_t *mag_data_x, int16_t *data_rhall)
{
	xdata int16_t retval;
    xdata uint16_t process_comp_x0;
    xdata int32_t process_comp_x1;
    xdata uint16_t process_comp_x2;
    xdata int32_t process_comp_x3;
    xdata int32_t process_comp_x4;
    xdata int32_t process_comp_x5;
    xdata int32_t process_comp_x6;
    xdata int32_t process_comp_x7;
    xdata int32_t process_comp_x8;
    xdata int32_t process_comp_x9;
    xdata int32_t process_comp_x10;

	//initialize value
	process_comp_x0 = 0; 

	if (*mag_data_x != BMM150_OVERFLOW_ADCVAL_XYAXES_FLIP){
		if (*data_rhall != 0)
		{
			/* Availability of valid data */
			process_comp_x0 = *data_rhall;
		}
		else if (dig_xyz1 != 0)
		{
			process_comp_x0 = dig_xyz1;
		}
		else
		{
			process_comp_x0 = 0;
		}
		if (process_comp_x0 != 0)
		{
			/* Processing compensation equations */
			process_comp_x1 = ((int32_t)dig_xyz1) * 16384;
			process_comp_x2 = ((uint16_t)(process_comp_x1 / process_comp_x0)) - ((uint16_t)0x4000);
			retval = ((int16_t)process_comp_x2);
			process_comp_x3 = (((int32_t)retval) * ((int32_t)retval));
			process_comp_x4 = (((int32_t)dig_xy2) * (process_comp_x3 / 128));
			process_comp_x5 = (int32_t)(((int16_t)dig_xy1) * 128);
			process_comp_x6 = ((int32_t)retval) * process_comp_x5;
			process_comp_x7 = (((process_comp_x4 + process_comp_x6) / 512) + ((int32_t)0x100000));
			process_comp_x8 = ((int32_t)(((int16_t)dig_x2) + ((int16_t)0xA0)));
			process_comp_x9 = ((process_comp_x7 * process_comp_x8) / 4096);
			process_comp_x10 = ((int32_t)*mag_data_x) * process_comp_x9;
			retval = ((int16_t)(process_comp_x10 / 8192));
			retval = (retval + (((int16_t)dig_x1) * 8)) / 16;
		}
		else {
			retval = BMM150_OVERFLOW_OUTPUT; 
		}
	}
	else{
		retval = BMM150_OVERFLOW_OUTPUT; 
	}
	return retval; 
}

int16_t BMM150_compensate_y (int16_t *mag_data_y, int16_t *data_rhall)
{
	xdata int16_t retval;
    xdata uint16_t process_comp_y0;
    xdata int32_t process_comp_y1;
    xdata uint16_t process_comp_y2;
    xdata int32_t process_comp_y3;
    xdata int32_t process_comp_y4;
    xdata int32_t process_comp_y5;
    xdata int32_t process_comp_y6;
    xdata int32_t process_comp_y7;
    xdata int32_t process_comp_y8;
    xdata int32_t process_comp_y9;

	//initialize variable
	process_comp_y0 = 0; 

