YuzheJi/ELEC-291-project-2/EFM8_JDY40_test_Slave/main.c
    /* Overflow condition check */
    if (*mag_data_y != BMM150_OVERFLOW_ADCVAL_XYAXES_FLIP)
    {
        if (*data_rhall != 0)
        {
            /* Availability of valid data */
            process_comp_y0 = *data_rhall;
        }
        else if (dig_xyz1 != 0)
        {
            process_comp_y0 = dig_xyz1;
        }
        else
        {
            process_comp_y0 = 0;
        }

        if (process_comp_y0 != 0)
        {
            /* Processing compensation equations */
            process_comp_y1 = (((int32_t)dig_xyz1) * 16384) / process_comp_y0;
            process_comp_y2 = ((uint16_t)process_comp_y1) - ((uint16_t)0x4000);
            retval = ((int16_t)process_comp_y2);
            process_comp_y3 = ((int32_t) retval) * ((int32_t)retval);
            process_comp_y4 = ((int32_t)dig_xy2) * (process_comp_y3 / 128);
            process_comp_y5 = ((int32_t)(((int16_t)dig_xy1) * 128));
            process_comp_y6 = ((process_comp_y4 + (((int32_t)retval) * process_comp_y5)) / 512);
            process_comp_y7 = ((int32_t)(((int16_t)dig_y2) + ((int16_t)0xA0)));
            process_comp_y8 = (((process_comp_y6 + ((int32_t)0x100000)) * process_comp_y7) / 4096);
            process_comp_y9 = (((int32_t)*mag_data_y) * process_comp_y8);
            retval = (int16_t)(process_comp_y9 / 8192);
            retval = (retval + (((int16_t)dig_y1) * 8)) / 16;
        }
        else
        {
            retval = BMM150_OVERFLOW_OUTPUT;
        }
    }
    else
    {
        /* Overflow condition */
        retval = BMM150_OVERFLOW_OUTPUT;
    }

    return retval;
}

void BMM150_Read_Data(int16_t *mag_x, int16_t *mag_y)
{
	xdata uint8_t raw_x_lsb, raw_x_msb, raw_y_lsb, raw_y_msb, raw_rhall_lsb, raw_rhall_msb; 
	// xdata uint8_t raw_z_lsb, raw_z_msb; 
	// xdata int16_t z_val; 
	xdata int16_t x_val, y_val, rhall_val;  
	xdata int16_t msb_data; 
	raw_x_lsb = SPI_read(BMM150_DATA_X_LSB);
	raw_x_msb = SPI_read(BMM150_DATA_X_MSB);
	raw_y_lsb = SPI_read(BMM150_DATA_Y_LSB);
	raw_y_msb = SPI_read(BMM150_DATA_Y_MSB);
	// raw_z_lsb = SPI_read(BMM150_DATA_Z_LSB);
	// raw_z_msb = SPI_read(BMM150_DATA_Z_MSB);
	raw_rhall_lsb = SPI_read(BMM150_RHALL_LSB); 
	raw_rhall_msb = SPI_read(BMM150_RHALL_MSB);


	// Extract X data (13-bit, 2's complement)
	raw_x_lsb = ((raw_x_lsb & 0b_1111_1000)) >> 3;
	msb_data = ((int16_t)((int8_t)raw_x_msb)) << 5; 
	x_val = (int16_t)(msb_data | raw_x_lsb);

	// Extract Y data (13-bit, 2's complement)
	raw_y_lsb = ((raw_y_lsb & 0b_1111_1000)) >> 3;
	msb_data = ((int16_t)((int8_t)raw_y_msb)) << 5; 
	y_val = (int16_t)(msb_data | raw_y_lsb);

	// Extract Z data (15-bit, 2's complement) - NOT USED 
	// raw_z_lsb = ((raw_z_lsb & 0xFE) >> 1);
	// msb_data = ((int16_t)((int8_t)raw_z_msb)) >> 7; 
	// z_val = (int16_t)(msb_data | raw_z_lsb);

	//Extract R-HALL data (14-bit, 2's complement)
	raw_rhall_lsb = ((raw_rhall_lsb & 0xFC) >> 2);
	rhall_val = (uint16_t)(((uint16_t)raw_rhall_msb << 6) | raw_rhall_lsb);

	// printf("%d, %d, %d, %d\r\n", x_val, y_val, z_val, rhall_val);
	*mag_x = BMM150_compensate_x(&x_val, &rhall_val);
	*mag_y = BMM150_compensate_y(&y_val, &rhall_val);
	// *mag_z = BMM150_compensate_z(&z_val, &rhall_val);
	// printf("%d, %d\r\n", *mag_x, *mag_y);
}


void UART1_Init (unsigned long baudrate)
{
    SFRPAGE = 0x20;
	SMOD1 = 0x0C; // no parity, 8 data bits, 1 stop bit
	SCON1 = 0x10;
	SBCON1 =0x00;   // disable baud rate generator
	SBRL1 = 0x10000L-((SYSCLK/baudrate)/(12L*2L));
	TI1 = 1; // indicate ready for TX
	SBCON1 |= 0x40;   // enable baud rate generator
	SFRPAGE = 0x00;
}

void putchar1 (char c) 
{
    SFRPAGE = 0x20;
	while (!TI1);
	TI1=0;
	SBUF1 = c;
	SFRPAGE = 0x00;
}

void sendstr1 (char * s)
{
	while(*s)
	{
		putchar1(*s);
		s++;	
	}
}

char getchar1 (void)
{
	xdata char c;
    SFRPAGE = 0x20;
	while (!RI1);
	RI1=0;
	// Clear Overrun and Parity error flags 
	SCON1&=0b_0011_1111;
	c = SBUF1;
	SFRPAGE = 0x00;
	return (c);
}

char getchar1_with_timeout (void)
{
	xdata char c;
	xdata unsigned int timeout;
    SFRPAGE = 0x20;
    timeout=0;
	while (!RI1)
	{
		SFRPAGE = 0x00;
		Timer3us(20);
		SFRPAGE = 0x20;
		timeout++;
		if(timeout==25000)
		{
			SFRPAGE = 0x00;
			return ('\n'); // Timeout after half second
		}
	}
	RI1=0;
	// Clear Overrun and Parity error flags 
	SCON1&=0b_0011_1111;
	c = SBUF1;
	SFRPAGE = 0x00;
	return (c);
}

void getstr1 (char * s, unsigned char n)
{
	xdata char c;
	xdata unsigned char cnt;
	
	cnt=0;
	while(1)
	{
		c=getchar1_with_timeout();
		if(c=='\n')
		{
			*s=0;
			return;
		}
		
		if (cnt<n)
		{
			cnt++;
			*s=c;
			s++;
		}
		else
		{
			*s=0;
			return;
		}
	}
}

// RXU1 returns '1' if there is a byte available in the receive buffer of UART1
bit RXU1 (void)
{
	bit mybit;
    SFRPAGE = 0x20;
	mybit=RI1;
	SFRPAGE = 0x00;
	return mybit;
}

void waitms_or_RI1 (unsigned int ms)
{
	xdata unsigned int j;
	xdata unsigned char k;
	for(j=0; j<ms; j++)
	{
		for (k=0; k<4; k++)
		{
			if(RXU1()) return;
			Timer3us(250);
		}
	}
}

void SendATCommand (char * s)
{
	printf("Command: %s", s);
	P2_0=0; // 'set' pin to 0 is 'AT' mode.
	waitms(5);
	sendstr1(s);
	getstr1(buff, sizeof(buff)-1);
	waitms(10);
	P2_0=1; // 'set' pin to 1 is normal operation mode.
	printf("Response: %s\r\n", buff);
}

void ReceptionOff (void)
{
	P2_0=0; // 'set' pin to 0 is 'AT' mode.
	waitms(10);
	sendstr1("AT+DVID0000\r\n"); // Some unused id, so that we get nothing in RXD1.
	waitms(10);
	// Clear Overrun and Parity error flags 
	SCON1&=0b_0011_1111;
	P2_0=1; // 'set' pin to 1 is normal operation mode.
}

int measure_distance(void)
{
	// xdata int answer;
	// xdata unsigned int i = 0;
	TL0 = 0; 
	TH0 = 0; 
	TF0 = 0; 
	duration = 0;

	TRIG_PIN = 1; 
	for(i = 0; i < 40; i++);
	TRIG_PIN = 0; 

	i=0;
	while (ECHO_PIN != 0){
		i++;
		if (i > 200){
			// printf("Time out\r\n");
		}
	};
	i=0;
	while (ECHO_PIN != 1){
		i++;
		if (i > 300){
			// printf("Time out\r\n");
		}
	}
	TR0 = 1; 
	while (ECHO_PIN == 1)
	{
		if (TF0 == 1){
			TF0 = 0; 
		}
		if(TH0 > 200){
			return -3;
		}
		
