YuzheJi/ELEC-291-project-2/EFM8_JDY40_test_Slave/main.c
void Move_forward_ms(int ms){

	L_motor_dir = 0;
	R_motor_dir = 0;

	pwm_left = 50;
	pwm_right = 50;

	waitms(ms);

	L_motor_dir = 0;
	R_motor_dir = 0;
	pwm_left = 0;
	pwm_right = 0;
	return;
}

void servo_moveaway(void)
{	pwm_left = 0;
	pwm_right = 0;
	servo_push();
	waitms(100);
	Move_forward_ms(500);
	servo_push();
	return; 
}

int check_bound(int d1, int d2){
	if(d1>10000||d2>10000)	return 1;
	else return 0;
}

void Init_all(){

	Set_Pin_Output(0x24);
    Set_Pin_Output(0x23);
    Set_Pin_Output(0x22);
    Set_Pin_Output(0x21);
	Set_Pin_Output(0x17);
	Set_Pin_Output(0x16);
	Set_Pin_Output(0x15);
	Set_Pin_Output(0x10); // CS

	Set_Pin_Input(0x30);
	Set_Pin_Output(0x25); // CLK for Load
	Set_Pin_Input(0x26);

	Set_Pin_Input(0x31);   //ECHO pin
	Set_Pin_Output(0x00);  // TRIGGER pin
	
	InitPinADC(1,3);
	InitPinADC(1,4);
	InitADC();

	TMOD&=0b_1111_0000; 
	TMOD|=0b_0000_0001; 
	TR0=0; 

	Servo_arm=0;
	Servo_base=0;
	Magnet = 0;
	PD_SCK = 0;
	return;
}

void Move_back_ms(int ms){

	L_motor_dir = 1;
	R_motor_dir = 1;

	pwm_left = 80;
	pwm_right = 80*pwm_corr;

	waitms(ms);

	L_motor_dir = 0;
	R_motor_dir = 0;
	pwm_left = 0;
	pwm_right = 0;
	return;
}


void Right_angle(int angle){

	L_motor_dir = 1;
	R_motor_dir = 0;
	pwm_left = 80;
	pwm_right = 80 * pwm_corr;

	waitms(angle);

	L_motor_dir = 0;
	R_motor_dir = 0;
	pwm_left = 0;
	pwm_right = 0;
	return;
}

void Move_forward(){

	L_motor_dir = 0;
	R_motor_dir = 0;
	pwm_left = 60;
	pwm_right = 60 * pwm_corr;
	return;
}

unsigned int simple_rand() {
    seed = (seed * 25173 + 13849) & 0xFFFF;  
    return seed;     
}

unsigned int get_random_90_250() {
    return (simple_rand() % (250 - 85 + 1)) + 90;
}

float Read_angle(void)
{
	// xdata uint8_t i; 
	xdata int16_t mag_x, mag_y; 
	xdata float sum_x, sum_y; 
	xdata float angle; 

	sum_x = 0.0; sum_y = 0.0;
	angle = 0.0;

	for (i = 0; i < 10; i++){
		BMM150_Read_Data(&mag_x, &mag_y);
		sum_x += (float)mag_x; 
		sum_y += (float)mag_y; 
		Timer3us(1);
	}
	angle = atan2f(sum_y, sum_x) * 180.0 / M_PI;
	if (angle < 0.0) angle += 360.0; 
	if (angle > 360.0) angle -= 360.0; 
	return angle; 
}

void Auto_mode_slave(){
	xdata int count = 0;
	xdata int command;
	xdata int state_res = 1;
	xdata int bound = 0;
	xdata char c;
	xdata int dummy;
	xdata unsigned int angle;

	// raw_angle = Read_angle();

	while(count < 20 && state_res){
		
		if(RXU1()){
			c=getchar1();	
			if(c=='!'){
				getstr1(buff, sizeof(buff)-1);
				if(strlen(buff)==11){
					// printf("master_messgae_auto_mode: %s\r\n", buff);
					sscanf(buff,"%03d,%03d,%01d,%01d",&dummy, &dummy,&dummy,&command);
					if(command) state_res = 1;
					else state_res = 0;
				}			
			}
			else if(c=='@'){
				sprintf(buff, "%01d,%02d,%ld,%05d,%03d,%03d,%03d\n", state_res, count,freq100, weight, (int)curr_angle,pwm_left,pwm_right);
				printf("%s\r\n",buff);
				waitms(5); 
				sendstr1(buff);
			}
		}

		Move_forward();
		d1 = ADC_at_Pin(QFP32_MUX_P1_3);
		d2 = ADC_at_Pin(QFP32_MUX_P1_4);
		bound = check_bound(d1,d2);
		printf("f:%04ld, d1:%d, d2:%d, bound_dectect: %d, distance: %d\r\n",freq100, d1,d2,bound,distance);

		if (freq100>=5355){
			mea_yes = 0;
			Move_back_ms(100);
			waitms(100);
			servo_pick();
			count++;
			waitms(100);
			mea_yes = 1;
			Move_forward();
		}

		if (distance < 400 && distance > 0){
			servo_moveaway();
		}

		if(bound == 1){
			Move_back_ms(400);
			waitms(100);
		 	angle = get_random_90_250();
			Right_angle(angle*600/90);
			// angle_diff = fabsf(raw_angle - last_raw_angle);
			curr_angle += angle; 
			if (curr_angle > 360.0) curr_angle -= 360.0; 
			else if (curr_angle < 0.0) curr_angle += 360.0; 
			printf("current angle: %03d\r\n", (int)curr_angle);

		}
		// last_raw_angle = raw_angle; 
	}
	dummy = 0;
	while(1){ 	
		
		if(RXU1()){
			c=getchar1();	
			if(c=='@'){
				dummy++;
				sprintf(buff, "%01d,20,%ld,%05d,%03d,%03d,%03d\n", state_res,freq100, weight, (int)curr_angle,pwm_left,pwm_right);
				printf("%s\r\n",buff);
				waitms(5); 
				sendstr1(buff);
			}
		}
		if(dummy==5)break;
		
	}
}

float Joystick_Control(int *vx_ptr, int *vy_ptr)
{
	// xdata int vx, vy; 
	xdata int vx_error, vy_error, vx_err, vy_err;
	vx = *vx_ptr; 
	vy = *vy_ptr; 

	//constantly updating the live raw angle 
	raw_angle = Read_angle();

	// Determine of Vx and Vy are within 5% error
	vx_error = abs(vx-vx_thres)*100/vx_thres; 
	vy_error = abs(vy-vy_thres)*100/vy_thres; 
	vx_err = vx-vx_thres; 
	vy_err = vy-vy_thres; 
	pwm_left = 0; 
	pwm_right = 0; 
	// if vx moved but vy didn't move => move forward 
	if ((vy_error>5) && (vx_error<5)){
		pwm_left = vy_error; 
		pwm_right = vy_error * pwm_corr; 
		if (vy_err > 0){ //move forward
			L_motor_dir = 0; 
			R_motor_dir = 0; 
		}
		else { //move backward 
			L_motor_dir = 1; 
			R_motor_dir = 1; 
			pwm_right *= 1.05;
		}
	}
	if ((vx_error>5)&&(vy_error<5)){
		// angle_diff = fabsf(raw_angle - last_raw_angle);
		pwm_left = vx_error; 
		pwm_right = vx_error * pwm_corr; 
		if (vx_err > 0){ //turn right
			L_motor_dir = 1; 
			R_motor_dir = 0;
			curr_angle += angle_diff * 1.45; // TUNE THIS
		}
		else{ //turn left 
			L_motor_dir = 0; 
			R_motor_dir = 1; 
			curr_angle -= angle_diff * 1.4; // TUNE THIS
		}
		if (curr_angle > 360.0) curr_angle -= 360.0; 
		if (curr_angle < 0.0) curr_angle += 360.0; 
	}
	if ((vx_error>5)&&(vy_error)>5){
		// Region 1 & Region 2
		angle_diff = fabsf(raw_angle - last_raw_angle);
		if (vy_err>0){
			L_motor_dir = 0; 
			R_motor_dir = 0; 
			// Region 1
			if (vx_err>0){
				// turn right
				if (vy*100<=vy_thres*100/2){
					pwm_left = vy_error; 
					pwm_right = pwm_corr*vy_error*100/(vx_error+vy_error);
				}
				else {
					pwm_left = vx_error; 
					pwm_right = pwm_corr*vx_error*100/(vx_error+vy_error);
				}
				curr_angle += angle_diff * 1.5; // TUNE THIS 
			}
			// Region 2
			else {
				if (vy*100<=vy_thres*100/2){
					pwm_left = vy_error*100/(vx_error+vy_error);
					pwm_right = vy_error*pwm_corr; 
				}
				else {
					pwm_left = vx_error*100/(vx_error+vy_error);
					pwm_right = vx_error*pwm_corr; 
				}
				curr_angle -= angle_diff * 1.5; // TUNE THIS 
			}
		}
		// Region 3 & 4
		if (vy_err<0){
			L_motor_dir = 1; 
			R_motor_dir = 1; 
			// Region 4
			if (vx_err>0){
				if (vy*100<=vy_thres*100/2){
					pwm_left = vy_error; 
					pwm_right = pwm_corr*vy_error*100/(vx_error+vy_error);
				}
				else {
					pwm_left = vx_error; 
					pwm_right = pwm_corr*vx_error*100/(vx_error+vy_error);
				}
				curr_angle -= angle_diff * 1.4; // TUNE THIS 
			}
			// Region 3
			else {
				if (vy*100<=vy_thres*100/2){
					pwm_left = vy_error*100/(vx_error+vy_error);
					pwm_right =pwm_corr*vy_error; 
				}
				else {
					pwm_left = vx_error*100/(vx_error+vy_error);
					pwm_right = pwm_corr*vx_error; 
				}
				curr_angle += angle_diff * 1.4; // TUNE THIS 
			}
		}
	}
	
