YuzheJi/ELEC-291-project-2/EFM8_JDY40_test_Slave/main.c
	last_raw_angle = raw_angle; 
	return curr_angle; 
}


void main (void)
{
    xdata char c;
	
	xdata angle_count = 0; 
	
	Init_all();
	BMM150_Init();
	waitms(500);
	UART1_Init(9600);
	
	ReceptionOff();

	// To check configuration
	SendATCommand("AT+VER\r\n");
	SendATCommand("AT+BAUD\r\n");
	SendATCommand("AT+RFID\r\n");
	SendATCommand("AT+DVID\r\n");
	SendATCommand("AT+RFC002\r\n");
	SendATCommand("AT+POWE\r\n");
	SendATCommand("AT+CLSS\r\n");
	SendATCommand("AT+DVIDEF11\r\n");  

    //initialize variables 
    L_bridge_1 = 0; 
    L_bridge_2 = 0; 
    R_bridge_1 = 0; 
    R_bridge_2 = 0; 
	vx = 0; 
	vy = 0; 
	
	//initialize current angle 
	curr_angle = Read_angle();
	while(1){	

		if(pick == '1'){
			servo_pick();
			waitms(1000);
			pick = '0';
		}
		
		if(auto_mode){
			Auto_mode_slave();
			auto_mode = 0;
		}

		if(RXU1()) // Something has arrived
		{
			c=getchar1();
			if(c=='!') // Master is sending message
			{
				getstr1(buff, sizeof(buff)-1);
				if(strlen(buff)==11)
				{
					// printf("Master says: %s\r\n", buff);
					//parse_values(buff);
					sscanf(buff,"%03d,%03d,%01d,%01d",&vx, &vy,&pick,&auto_mode);
					pick = buff[8];
		        	printf("Joystick Received: Vx = %d, Vy = %d, Order = %c, Auto = %d\r\n", vx, vy, pick, auto_mode);
					curr_angle = Joystick_Control(&vx, &vy);
				}
				else{
					printf("*** BAD MESSAGE ***: %s\r\n", buff);
				}		
			}
			else if(c=='@') // Master wants slave data
			{
				sprintf(buff, "0,00,%04ld,%05d,%03d,%03d,%03d\n", freq100, weight, (int)Read_angle(),pwm_left,pwm_right);
				printf("%s\r\n",buff);
				waitms(5); // The radio seems to need this delay...
				sendstr1(buff);
			}
		}
	}
}
